{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_540": {"name": "keras_tensor_540:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "512"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/part1_1/conv2d_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_1_2/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_1_2/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1_2/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_2_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_3_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_3_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_3_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_3_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_4_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_4_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_4_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_4_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_5_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_5_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_5_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_5_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_6_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_6_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_6_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_6_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_7_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_7_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_540", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["keras_tensor_540", "StatefulPartitionedCall/part1_1/conv2d_1/convolution/ReadVariableOp", "StatefulPartitionedCall/part1_1/conv2d_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/part1_1/conv2d_1/Relu", "StatefulPartitionedCall/part1_1/batch_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/part1_1/batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_1_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_1/batchnorm/add_1", "StatefulPartitionedCall/part1_1/conv2d_1_2/convolution/ReadVariableOp", "StatefulPartitionedCall/part1_1/conv2d_1_2/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1_2/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/part1_1/conv2d_1_2/Relu", "StatefulPartitionedCall/part1_1/batch_normalization_1_2/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1_2/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_1_2/batchnorm/mul_1", "StatefulPartitionedCall/part1_1/batch_normalization_1_2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/max_pooling2d_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_1_2/batchnorm/add_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/part1_1/max_pooling2d_1/MaxPool2d", "StatefulPartitionedCall/part1_1/conv2d_2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/part1_1/conv2d_2_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_2_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/part1_1/conv2d_2_1/Relu", "StatefulPartitionedCall/part1_1/batch_normalization_2_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_2_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_2_1/batchnorm/mul_1", "StatefulPartitionedCall/part1_1/batch_normalization_2_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_3_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_2_1/batchnorm/add_1", "StatefulPartitionedCall/part1_1/conv2d_3_1/convolution/ReadVariableOp", "StatefulPartitionedCall/part1_1/conv2d_3_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_3_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/part1_1/conv2d_3_1/Relu", "StatefulPartitionedCall/part1_1/batch_normalization_3_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_3_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_3_1/batchnorm/mul_1", "StatefulPartitionedCall/part1_1/batch_normalization_3_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/max_pooling2d_1_2/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_3_1/batchnorm/add_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_4_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/part1_1/max_pooling2d_1_2/MaxPool2d", "StatefulPartitionedCall/part1_1/conv2d_4_1/convolution/ReadVariableOp", "StatefulPartitionedCall/part1_1/conv2d_4_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_4_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/part1_1/conv2d_4_1/Relu", "StatefulPartitionedCall/part1_1/batch_normalization_4_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_4_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_4_1/batchnorm/mul_1", "StatefulPartitionedCall/part1_1/batch_normalization_4_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_5_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_4_1/batchnorm/add_1", "StatefulPartitionedCall/part1_1/conv2d_5_1/convolution/ReadVariableOp", "StatefulPartitionedCall/part1_1/conv2d_5_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_5_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/part1_1/conv2d_5_1/Relu", "StatefulPartitionedCall/part1_1/batch_normalization_5_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_5_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_5_1/batchnorm/mul_1", "StatefulPartitionedCall/part1_1/batch_normalization_5_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/max_pooling2d_2_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_5_1/batchnorm/add_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_6_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/part1_1/max_pooling2d_2_1/MaxPool2d", "StatefulPartitionedCall/part1_1/conv2d_6_1/convolution/ReadVariableOp", "StatefulPartitionedCall/part1_1/conv2d_6_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_6_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/part1_1/conv2d_6_1/Relu", "StatefulPartitionedCall/part1_1/batch_normalization_6_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_6_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_6_1/batchnorm/mul_1", "StatefulPartitionedCall/part1_1/batch_normalization_6_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_7_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/part1_1/batch_normalization_6_1/batchnorm/add_1", "StatefulPartitionedCall/part1_1/conv2d_7_1/convolution/ReadVariableOp", "StatefulPartitionedCall/part1_1/conv2d_7_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/part1_1/conv2d_7_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/part1_1/conv2d_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.33666965260225185, "scale": 0.0032372081980985754, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_1/Squeeze", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11522700248980056, "scale": 0.001719806007310456, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 5.038605690002441, "scale": 0.1136920218374215, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -4.726838736674365, "scale": 0.01913699893390431, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_1_2/convolution/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6662864918802298, "scale": 0.004972287252837536, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_1_2/Squeeze", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3569477165446562, "scale": 0.002704149367762547, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1_2/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.2738657295703888, "scale": 0.0937609989269107, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_1_2/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -4.767212326853883, "scale": 0.01953775543792575, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_2_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5708606402079265, "scale": 0.004797148237041399, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_2_1/Squeeze", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.30711564094412563, "scale": 0.0037001884451099473, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_2_1/batchnorm/mul", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.03023146279156208, "scale": 0.0006405112717081518, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_2_1/batchnorm/sub", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.0803775801378137, "scale": 0.008456819431454527, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_3_1/convolution/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5968575384102616, "scale": 0.004774860307282093, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_3_1/Squeeze", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5613857157090131, "scale": 0.004158412708955652, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_3_1/batchnorm/mul", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.020448800176382065, "scale": 0.00025204988379104465, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_3_1/batchnorm/sub", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.2767910957336426, "scale": 0.004546669183992872, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_4_1/convolution/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7502357445511164, "scale": 0.005771044188854741, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_4_1/Squeeze", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.43763171352592173, "scale": 0.003445919004141116, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_4_1/batchnorm/mul", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.005904881749302149, "scale": 0.0005127175820662695, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_4_1/batchnorm/sub", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.021015178456026, "scale": 0.005156642315434475, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_5_1/convolution/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7984101456754348, "scale": 0.006189225935468487, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_5_1/Squeeze", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6435375914854162, "scale": 0.0033001927768482884, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_5_1/batchnorm/mul", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.009916656650602818, "scale": 0.0019471376805621035, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_5_1/batchnorm/sub", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.1074466175892774, "scale": 0.005056833870270673, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_6_1/convolution/ReadVariableOp", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.915176024390202, "scale": 0.006142120969061758, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_6_1/Squeeze", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5650959323434269, "scale": 0.0034041923635146198, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_6_1/batchnorm/mul", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0, "scale": 0.023420355073176323, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/batch_normalization_6_1/batchnorm/sub", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.3646139705882354, "scale": 0.006962316176470589, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_7_1/convolution/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8894160186543185, "scale": 0.006263493089114919, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part1_1/conv2d_7_1/Squeeze", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5452188232365777, "scale": 0.003950861037946215, "original_dtype": "float32"}}]}]}