{"format": "layers-model", "generatedBy": "keras v3.13.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.13.2", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "Custom_CNN_FER2013_Official", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer", "optional": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 7, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}}], "build_input_shape": [null, 224, 224, 3]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0001250000059371814, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of14.bin", "group1-shard2of14.bin", "group1-shard3of14.bin", "group1-shard4of14.bin", "group1-shard5of14.bin", "group1-shard6of14.bin", "group1-shard7of14.bin", "group1-shard8of14.bin", "group1-shard9of14.bin", "group1-shard10of14.bin", "group1-shard11of14.bin", "group1-shard12of14.bin", "group1-shard13of14.bin", "group1-shard14of14.bin"], "weights": [{"name": "Custom_CNN_FER2013_Official/batch_normalization/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.6879749298095703, "scale": 0.0025321282592474246, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18667636940292284, "scale": 0.0014698926724639593, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 7.006492321624085e-44, "scale": 0.0019726369895187077, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 7.006492321624085e-44, "scale": 0.00015033021861431646, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_1/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.6924834251403809, "scale": 0.002554503141664991, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_1/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5832963024868685, "scale": 0.003600594459795484, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 7.006492321624085e-44, "scale": 0.02927420186061485, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 7.006492321624085e-44, "scale": 0.06353828579771753, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_2/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4453143775463104, "scale": 0.005466617439307419, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_2/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3687056793886072, "scale": 0.0030725473282383936, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_2/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 2.8649654388427734, "scale": 0.04190765081667432, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_2/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 14.307973861694336, "scale": 1.5347116881725835, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_3/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4760509133338928, "scale": 0.004361082759557986, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_3/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.32480825559765686, "scale": 0.002423942205952663, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_3/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 6.494797706604004, "scale": 0.0780659133312749, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_3/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 192.73240661621094, "scale": 5.7236108518114275, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_4/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.22195085883140564, "scale": 0.006211547874936871, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_4/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.25693431777112624, "scale": 0.0037236857647989312, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_4/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.794438362121582, "scale": 0.08252498028325099, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_4/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 35.00447463989258, "scale": 5.403250107110716, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_5/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4303920865058899, "scale": 0.004673395203609093, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_5/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5535257662043852, "scale": 0.00453709644429824, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_5/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.32557186484336853, "scale": 0.19895070826306063, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_5/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 4.568182468414307, "scale": 9.545306491851807, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_6/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.008312862417569348, "scale": 0.008312862417569348, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_6/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5002525404387829, "scale": 0.005321835536582797, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_6/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.003186638932675123, "scale": 0.2732525491411341, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_6/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.01841150037944317, "scale": 17.97816960257204, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_7/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06722706118050743, "scale": 0.009603865882929634, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_7/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.32648519616501004, "scale": 0.002283113259895175, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_7/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 7.006492321624085e-44, "scale": 0.37836294735179227, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_7/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 7.006492321624085e-44, "scale": 12.29017214307598, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_8/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5368602275848389, "scale": 0.0035492611866371304, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_8/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2741185300490435, "scale": 0.0024258276995490578, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_8/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.023486385121941566, "scale": 1.2625292487807718, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_8/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.1818149089813232, "scale": 328.0669646964354, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_9/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.19626596570014954, "scale": 0.0010776314080930224, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_9/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08053502756006577, "scale": 0.001118542049445358, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_9/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.99506413936615, "scale": 0.016804826493356743, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/batch_normalization_9/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 16.962139129638672, "scale": 0.2807496164359298, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d/kernel", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.33666965260225185, "scale": 0.0032372081980985754, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11522700248980056, "scale": 0.001719806007310456, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6662864918802298, "scale": 0.004972287252837536, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3569477165446562, "scale": 0.002704149367762547, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5708606402079265, "scale": 0.004797148237041399, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_2/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.30711564094412563, "scale": 0.0037001884451099473, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_3/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5968575384102616, "scale": 0.004774860307282093, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_3/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5613857157090131, "scale": 0.004158412708955652, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_4/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7502357445511164, "scale": 0.005771044188854741, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_4/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.43763171352592173, "scale": 0.003445919004141116, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_5/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7984101456754348, "scale": 0.006189225935468487, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_5/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6435375914854162, "scale": 0.0033001927768482884, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_6/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.915176024390202, "scale": 0.006142120969061758, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_6/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5650959323434269, "scale": 0.0034041923635146198, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_7/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8894160186543185, "scale": 0.006263493089114919, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/conv2d_7/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5452188232365777, "scale": 0.003950861037946215, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/dense/kernel", "shape": [100352, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8686875775748608, "scale": 0.007179236178304635, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/dense/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3548721745902417, "scale": 0.0023816924469143735, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/dense_1/kernel", "shape": [512, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8950878007739198, "scale": 0.006173019315682205, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/dense_1/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.594544670161079, "scale": 0.0055564922444960654, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/dense_2/kernel", "shape": [256, 7], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.45813241571772334, "scale": 0.0026178995183869904, "original_dtype": "float32"}}, {"name": "Custom_CNN_FER2013_Official/dense_2/bias", "shape": [7], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5570161783227734, "scale": 0.003295953717886233, "original_dtype": "float32"}}]}]}