{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_528": {"name": "keras_tensor_528:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "512"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/part2_1/batch_normalization_7_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_7_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/part2_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100352"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_8_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_8_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_9_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_9_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/dense_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_528", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_7_1/batchnorm/mul_1", "op": "Mul", "input": ["keras_tensor_528", "StatefulPartitionedCall/part2_1/batch_normalization_7_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_7_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/part2_1/batch_normalization_7_1/batchnorm/mul_1", "StatefulPartitionedCall/part2_1/batch_normalization_7_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/max_pooling2d_3_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/part2_1/batch_normalization_7_1/batchnorm/add_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/part2_1/max_pooling2d_3_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/part2_1/flatten_1/Shape", "StatefulPartitionedCall/part2_1/flatten_1/strided_slice/stack", "StatefulPartitionedCall/part2_1/flatten_1/strided_slice/stack_1", "StatefulPartitionedCall/part2_1/flatten_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/part2_1/flatten_1/strided_slice", "StatefulPartitionedCall/part2_1/flatten_1/Reshape/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/part2_1/max_pooling2d_3_1/MaxPool2d", "StatefulPartitionedCall/part2_1/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/part2_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/part2_1/flatten_1/Reshape", "StatefulPartitionedCall/part2_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/part2_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_8_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/part2_1/dense_1/Relu", "StatefulPartitionedCall/part2_1/batch_normalization_8_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_8_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/part2_1/batch_normalization_8_1/batchnorm/mul_1", "StatefulPartitionedCall/part2_1/batch_normalization_8_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/dense_1_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/part2_1/batch_normalization_8_1/batchnorm/add_1", "StatefulPartitionedCall/part2_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/part2_1/dense_1_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_9_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/part2_1/dense_1_2/Relu", "StatefulPartitionedCall/part2_1/batch_normalization_9_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_9_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/part2_1/batch_normalization_9_1/batchnorm/mul_1", "StatefulPartitionedCall/part2_1/batch_normalization_9_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/dense_2_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/part2_1/batch_normalization_9_1/batchnorm/add_1", "StatefulPartitionedCall/part2_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/part2_1/dense_2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/part2_1/dense_2_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/part2_1/dense_2_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/part2_1/dense_2_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of13.bin", "group1-shard2of13.bin", "group1-shard3of13.bin", "group1-shard4of13.bin", "group1-shard5of13.bin", "group1-shard6of13.bin", "group1-shard7of13.bin", "group1-shard8of13.bin", "group1-shard9of13.bin", "group1-shard10of13.bin", "group1-shard11of13.bin", "group1-shard12of13.bin", "group1-shard13of13.bin"], "weights": [{"name": "StatefulPartitionedCall/part2_1/batch_normalization_7_1/batchnorm/mul", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0, "scale": 0.18991226739907527, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_7_1/batchnorm/sub", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.4490932613611223, "scale": 0.00632791817188263, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/part2_1/flatten_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/part2_1/dense_1/Cast/ReadVariableOp", "shape": [100352, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8686875775748608, "scale": 0.007179236178304635, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part2_1/dense_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3548721745902417, "scale": 0.0023816924469143735, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_8_1/batchnorm/mul", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.003857408184558153, "scale": 0.0019636092068371818, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_8_1/batchnorm/sub", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.7710818523285434, "scale": 0.0072585321816743585, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part2_1/dense_1_2/Cast/ReadVariableOp", "shape": [512, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8950878007739198, "scale": 0.006173019315682205, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part2_1/dense_1_2/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.594544670161079, "scale": 0.0055564922444960654, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_9_1/batchnorm/mul", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.026763947680592537, "scale": 0.0003066270886098637, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part2_1/batch_normalization_9_1/batchnorm/sub", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.31899532675743103, "scale": 0.001167149637259689, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part2_1/dense_2_1/Cast/ReadVariableOp", "shape": [256, 7], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.45813241571772334, "scale": 0.0026178995183869904, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/part2_1/dense_2_1/BiasAdd/ReadVariableOp", "shape": [7], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5570161783227734, "scale": 0.003295953717886233, "original_dtype": "float32"}}]}]}